In [1]:
import pandas as pd
import geopandas as gpd

In [ ]:
schools = gpd.read_parquet('SchoolCounty_Data.parquet')

In [ ]:
schools.head()

In [ ]:
schools.rename(column={})

In [ ]:
schools.columns

In [ ]:
test = pd.read_csv('attendance_rates.csv')

In [ ]:
test

In [ ]:
test.columns

In [2]:
graduation = pd.read_csv('graduation_rates.csv')

In [3]:
graduation.head()

,Unnamed: 0,Unnamed: 0.1,AcademicYear,AggregateLevel,CountyCode,DistrictCode,SchoolCode,CountyName,DistrictName,SchoolName,...,SPED Certificate (Count),SPED Certificate (Rate),GED Completer (Count),GED Completer (Rate),Other Transfer (Count),Other Transfer (Rate),Dropout (Count),Dropout (Rate),Still Enrolled (Count),Still Enrolled (Rate)
0,0,0,2019-20,C,1,NaN,NaN,Alameda,NaN,NaN,...,65,0.8,2,0.0,24,0.3,440,5.2,228,2.7
1,1,1,2019-20,C,1,NaN,NaN,Alameda,NaN,NaN,...,123,1.3,1,0.0,54,0.6,823,9.0,417,4.6
2,2,2,2019-20,C,1,NaN,NaN,Alameda,NaN,NaN,...,24,0.6,0,0.0,11,0.3,112,2.6,41,1.0
3,3,3,2019-20,C,1,NaN,NaN,Alameda,NaN,NaN,...,39,2.2,0,0.0,10,0.6,167,9.2,148,8.2
4,4,4,2019-20,C,1,NaN,NaN,Alameda,NaN,NaN,...,3,3.3,0,0.0,4,4.3,15,16.3,7,7.6

In [4]:
graduation.columns

Index(['Unnamed: 0', 'Unnamed: 0.1', 'AcademicYear', 'AggregateLevel',
       'CountyCode', 'DistrictCode', 'SchoolCode', 'CountyName',
       'DistrictName', 'SchoolName', 'CharterSchool', 'DASS',
       'ReportingCategory', 'CohortStudents',
       'Regular HS Diploma Graduates (Count)',
       'Regular HS Diploma Graduates (Rate)', 'Met UC/CSU Grad Req's (Count)',
       'Met UC/CSU Grad Req's (Rate)', 'Seal of Biliteracy (Count)',
       'Seal of Biliteracy (Rate)', 'Golden State Seal Merit Diploma (Count)',
       'Golden State Seal Merit Diploma (Rate', 'CHSPE Completer (Count)',
       'CHSPE Completer (Rate)', 'Adult Ed. HS Diploma (Count)',
       'Adult Ed. HS Diploma (Rate)', 'SPED Certificate (Count)',
       'SPED Certificate (Rate)', 'GED Completer (Count)',
       'GED Completer (Rate)', 'Other Transfer (Count)',
       'Other Transfer (Rate)', 'Dropout (Count)', 'Dropout (Rate)',
       'Still Enrolled (Count)', 'Still Enrolled (Rate)'],
      dtype='object')

In [5]:
graduation = graduation[['CountyName','Dropout (Count)']]

In [6]:
graduation = graduation.rename(columns={'Dropout (Count)':'Dropout_Count'})

In [27]:
import numpy as np

In [28]:
graduation = graduation.replace("*",np.nan)

#need to replace one value that has a *

In [29]:
graduation = graduation.fillna(0)

In [30]:
gradution = graduation.replace("*",np.nan)

In [31]:
graduation.Dropout_Count = graduation.Dropout_Count.astype(float)

In [32]:
graduation = graduation[['Dropout_Count',"CountyName"]]

In [34]:
dropout_count = graduation[['Dropout_Count',"CountyName"]].groupby("CountyName").sum()

In [35]:
dropout_count

                 Dropout_Count
CountyName
Alameda                67080.0
Amador                   336.0
Butte                  12754.0
Calaveras                774.0
Colusa                   820.0
Contra Costa           39782.0
Del Norte               1238.0
El Dorado               5559.0
Fresno                 89441.0
Glenn                   3113.0
Humboldt                3064.0
Imperial               18408.0
Inyo                   13298.0
Kern                   61765.0
Kings                   8390.0
Lake                    4881.0
Lassen                   572.0
Los Angeles           577832.0
Madera                  8336.0
Marin                   8921.0
Mariposa                 228.0
Mendocino               6110.0
Merced                 15175.0
Modoc                    424.0
Mono                    5770.0
Monterey               23354.0
Napa                    6594.0
Nevada                 10004.0
Orange                108576.0
Placer                 17704.0
Plumas                   774.0
Riverside              97699.0
Sacramento             77704.0
San Benito              4400.0
San Bernardino        196184.0
San Diego             172239.0
San Francisco          34021.0
San Joaquin            75011.0
San Luis Obispo         7161.0
San Mateo              26442.0
Santa Barbara          20801.0
Santa Clara           150978.0
Santa Cruz             19930.0
Shasta                  7932.0
Sierra                    48.0
Siskiyou                1548.0
Solano                 24519.0
Sonoma                 31115.0
Stanislaus             47784.0
State                 776210.0
Sutter                  8853.0
Tehama                  2324.0
Trinity                  691.0
Tulare                 27995.0
Tuolumne                1595.0
Ventura                42100.0
Yolo                    7937.0
Yuba                    5260.0

In [36]:
#dropout_count.to_parquet("dropout_count.to_parquet")

# alameda test case

In [7]:
alameda = graduation[graduation.CountyName == 'Alameda']

In [8]:
alameda.head()

  CountyName Dropout_Count
0    Alameda           440
1    Alameda           823
2    Alameda           112
3    Alameda           167
4    Alameda            15

In [9]:
alameda.dtypes

CountyName       object
Dropout_Count    object
dtype: object

In [10]:
alameda.Dropout_Count.unique()

array(['440', '823', '112', '167', '15', '35', '701', '3', '12', '44',
       '174', '241', '505', '45', '239', '4', '978', '1263', '308', '568',
       '99', '84', '10', '26', '474', '1', '6', '38', '138', '178', '370',
       '146', '2', '633', '876', '132', '255', '13', '83', '5', '9',
       '227', '36', '63', '135', '33', '93', '345', '387', '374', '723',
       '102', '142', '14', '31', '602', '11', '161', '207', '449', '222',
       '836', '1097', '268', '502', '89', '72', '23', '416', '27', '127',
       '153', '340', '141', '547', '770', '106', '221', '70', '8', '186',
       '*', '34', '54', '109', '81', '289', '327', '66', '100', '25',
       '56', '7', '17', '166', '40', '58', '30', '86', '41', '60', '62',
       '16', '21', '105', '107', '39', '42', '24', '95', '97', '47', '18',
       '28', '73', '19', '32', '22', '0', '37', '46', '20', '29', '61',
       '49', '108', '59', '55', '94', '53', '92', '48', '80', '43', '121',
       '52', '90', '154', '110', '111', '136', '145', '88', '71', '134',
       '143', '79', '103', '139', '291', '237', '371', '407', '210',
       '231', '288', '318', '51', '120', '226', '249', '218', '129',
       '316', '346', '171', '193', '169', '264', '77', '82', '85', '50',
       '57', '78', '64', '65'], dtype=object)

In [15]:
#drc = alameda.Dropout_Count

In [16]:
#(drc=="*").sum()

0

In [17]:
import numpy as np

In [18]:
alameda = alameda.replace("*",np.nan)

In [19]:
alameda = alameda.fillna(0)

In [20]:
alameda

      CountyName Dropout_Count
0        Alameda           440
1        Alameda           823
2        Alameda           112
3        Alameda           167
4        Alameda            15
...          ...           ...
73142    Alameda             0
73143    Alameda             1
73144    Alameda             0
73145    Alameda             0
73146    Alameda             2

[9549 rows x 2 columns]

In [21]:
alameda = alameda.replace("*",np.nan)

In [22]:
alameda.Dropout_Count = alameda.Dropout_Count.astype(float)

In [23]:
alameda.Dropout_Count.head()

0    440.0
1    823.0
2    112.0
3    167.0
4     15.0
Name: Dropout_Count, dtype: float64

In [24]:
alameda[['Dropout_Count',"CountyName"]]

       Dropout_Count CountyName
0              440.0    Alameda
1              823.0    Alameda
2              112.0    Alameda
3              167.0    Alameda
4               15.0    Alameda
...              ...        ...
73142            0.0    Alameda
73143            1.0    Alameda
73144            0.0    Alameda
73145            0.0    Alameda
73146            2.0    Alameda

[9549 rows x 2 columns]

In [26]:
alameda.Dropout_Count.sum()

67080.0